Revit 2027 API
BuiltInFailures.SystemsFailures.CircuitWorksetClosedWarning Property
 The workset of the circuit is closed so the circuit path will not be displayed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CircuitWorksetClosedWarning { get; }
Public Shared ReadOnly Property CircuitWorksetClosedWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CircuitWorksetClosedWarning {
	FailureDefinitionId^ get ();
}
static member CircuitWorksetClosedWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SystemsFailures Class
Autodesk.Revit.DB Namespace